Revit 2027 API
IFailuresPreprocessor Methods
The IFailuresPreprocessor type exposes the following members.
Methods
Name | Description
PreprocessFailures |  This method is called when there have been failures found at the end of a transaction and Revit is about to start processing them.
Top
See Also
Reference
IFailuresPreprocessor Interface
Autodesk.Revit.DB Namespace